podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USART1_STM32F030.svd.xml
<!--
Devices using this peripheral: 
      STM32F030
-->
      <peripheral>
         <?sourceFile "USART1_STM32F030" ?>
         <name>USART1</name>
         <description>Universal synchronous asynchronous receiver
      transmitter</description>
         <groupName>USART</groupName>
         <headerStructName>USART1</headerStructName>
         <baseAddress>0x40013800</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x2C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR1</name>
               <description>Control register 1</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>UE</name>
                     <description>USART enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UESM</name>
                     <description>USART enable in Stop mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RE</name>
                     <description>Receiver enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TE</name>
                     <description>Transmitter enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLEIE</name>
                     <description>IDLE interrupt enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNEIE</name>
                     <description>RXNE interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCIE</name>
                     <description>Transmission complete interrupt
              enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEIE</name>
                     <description>interrupt enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEIE</name>
                     <description>PE interrupt enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PS</name>
                     <description>Parity selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCE</name>
                     <description>Parity control enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKE</name>
                     <description>Receiver wakeup method</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M</name>
                     <description>Word length</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MME</name>
                     <description>Mute mode enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMIE</name>
                     <description>Character match interrupt
              enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVER8</name>
                     <description>Oversampling mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEDT</name>
                     <description>Driver Enable deassertion
              time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DEAT</name>
                     <description>Driver Enable assertion
              time</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>RTOIE</name>
                     <description>Receiver timeout interrupt
              enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOBIE</name>
                     <description>End of Block interrupt
              enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>M1</name>
                     <description>Word length</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR2</name>
               <description>Control register 2</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>ADDM7</name>
                     <description>7-bit Address Detection/4-bit Address
              Detection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBDL</name>
                     <description>LIN break detection length</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBDIE</name>
                     <description>LIN break detection interrupt
              enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBCL</name>
                     <description>Last bit clock pulse</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPHA</name>
                     <description>Clock phase</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOL</name>
                     <description>Clock polarity</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLKEN</name>
                     <description>Clock enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>STOP bits</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>LINEN</name>
                     <description>LIN mode enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWAP</name>
                     <description>Swap TX/RX pins</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXINV</name>
                     <description>RX pin active level
              inversion</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXINV</name>
                     <description>TX pin active level
              inversion</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAINV</name>
                     <description>Binary data inversion</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSBFIRST</name>
                     <description>Most significant bit first</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABREN</name>
                     <description>Auto baud rate enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABRMOD</name>
                     <description>Auto baud rate mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RTOEN</name>
                     <description>Receiver timeout enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADD0</name>
                     <description>Address of the USART node</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADD4</name>
                     <description>Address of the USART node</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR3</name>
               <description>Control register 3</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>EIE</name>
                     <description>Error interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IREN</name>
                     <description>IrDA mode enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IRLP</name>
                     <description>IrDA low-power</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HDSEL</name>
                     <description>Half-duplex selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>Smartcard NACK enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCEN</name>
                     <description>Smartcard mode enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAR</name>
                     <description>DMA enable receiver</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAT</name>
                     <description>DMA enable transmitter</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTSE</name>
                     <description>RTS enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSE</name>
                     <description>CTS enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIE</name>
                     <description>CTS interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONEBIT</name>
                     <description>One sample bit method
              enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRDIS</name>
                     <description>Overrun Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DDRE</name>
                     <description>DMA Disable on Reception
              Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEM</name>
                     <description>Driver enable mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEP</name>
                     <description>Driver enable polarity
              selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCARCNT</name>
                     <description>Smartcard auto-retry count</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>WUS</name>
                     <description>Wakeup from Stop mode interrupt flag
              selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>WUFIE</name>
                     <description>Wakeup from Stop mode interrupt
              enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BRR</name>
               <description>Baud rate register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>DIV_Fraction</name>
                     <description>fraction of USARTDIV</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DIV_Mantissa</name>
                     <description>mantissa of USARTDIV</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GTPR</name>
               <description>Guard time and prescaler
          register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>PSC</name>
                     <description>Prescaler value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GT</name>
                     <description>Guard time value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTOR</name>
               <description>Receiver timeout register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>RTO</name>
                     <description>Receiver timeout value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>BLEN</name>
                     <description>Block Length</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RQR</name>
               <description>Request register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>ABRRQ</name>
                     <description>Auto baud rate request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBKRQ</name>
                     <description>Send break request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MMRQ</name>
                     <description>Mute mode request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFRQ</name>
                     <description>Receive data flush request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFRQ</name>
                     <description>Transmit data flush
              request</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
