podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USART1_STM32F030.svd.xml
            <register>
               <name>ISR</name>
               <description>Interrupt &amp; status
          register</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
               <resetValue>0xC0</resetValue>
               <fields>
                  <field>
                     <name>PE</name>
                     <description>Parity error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FE</name>
                     <description>Framing error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NF</name>
                     <description>Noise detected flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ORE</name>
                     <description>Overrun error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>Idle line detected</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNE</name>
                     <description>Read data register not
              empty</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC</name>
                     <description>Transmission complete</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXE</name>
                     <description>Transmit data register
              empty</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBDF</name>
                     <description>LIN break detection flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIF</name>
                     <description>CTS interrupt flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>CTS flag</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTOF</name>
                     <description>Receiver timeout</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOBF</name>
                     <description>End of block flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABRE</name>
                     <description>Auto baud rate error</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABRF</name>
                     <description>Auto baud rate flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMF</name>
                     <description>character match flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SBKF</name>
                     <description>Send break flag</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWU</name>
                     <description>Receiver wakeup from Mute
              mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUF</name>
                     <description>Wakeup from Stop mode flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEACK</name>
                     <description>Transmit enable acknowledge
              flag</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>REACK</name>
                     <description>Receive enable acknowledge
              flag</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <description>Interrupt flag clear register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>PECF</name>
                     <description>Parity error clear flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FECF</name>
                     <description>Framing error clear flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NCF</name>
                     <description>Noise detected clear flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ORECF</name>
                     <description>Overrun error clear flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDLECF</name>
                     <description>Idle line detected clear
              flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCCF</name>
                     <description>Transmission complete clear
              flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBDCF</name>
                     <description>LIN break detection clear
              flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSCF</name>
                     <description>CTS clear flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTOCF</name>
                     <description>Receiver timeout clear
              flag</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOBCF</name>
                     <description>End of timeout clear flag</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMCF</name>
                     <description>Character match clear flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUCF</name>
                     <description>Wakeup from Stop mode clear
              flag</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RDR</name>
               <description>Receive data register</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDR</name>
                     <description>Receive data value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDR</name>
               <description>Transmit data register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>TDR</name>
                     <description>Transmit data value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
